## Practical Exam: Loan Insights
<p>EasyLoan offers a wide range of loan services, including personal loans, car loans, and mortgages.</p>
<p>EasyLoan offers loans to clients from Canada, United Kingdom and United States.</p>
<p>The analytics team wants to report performance across different geographic areas. They aim to identify areas of strength and weakness for the business strategy team.</p>
<p>They need your help to ensure the data is accessible and reliable before they start reporting.</p>
<p>The data you need is in the database named <code>lending</code>.</p>
<p><strong>Database Schema</strong></p>
<p><img src="datasets/lending_schema.png"></p>
<h2 id="task1">Task 1</h2>
<p>The analytics team wants to use the <code>client</code> table to create a dashboard for client details. For them to proceed, they need to be sure the data is clean enough to use.</p>
<p>The <code>client</code> table below illustrates what the analytics team expects the data types and format to be.</p>
<table>
<thead>
<tr>
<th>Column Name</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td>client_id</td>
<td>Unique integer (set by the database, canâ€™t take any other value)</td>
</tr>
<tr>
<td>date_of_birth</td>
<td>Date of birth of the client, as a date  (format: YYYY-MM-DD)</td>
</tr>
<tr>
<td>employment_status</td>
<td>Current employment status of the client, either employed or unemployed, as a lower case string</td>
</tr>
<tr>
<td>country</td>
<td>The country where the client resides, either USA, UK or CA, as an upper case string</td>
</tr>
</tbody>
</table>
<p>Write a query to ensure that the <code>client</code> table matches the description provided. Your query should not update the <code>client</code> table.</p>

In [2]:
%%sql 

-- Keep the two lines above
-- Start your answers here..
SELECT client_id, CAST(date_of_birth AS DATE), LOWER(CASE
                                                     WHEN employment_status LIKE 'Emplouyed' THEN 'employed'
                                                    WHEN employment_status LIKE 'Full-time' THEN 'employed'
                                                    WHEN employment_status LIKE 'Part-time' THEN 'employed'
                                                    ELSE employment_status
                                                    END) AS employment_status, UPPER(country) AS country
FROM client
LIMIT 15

 * postgresql://postgres:***@localhost:5432/lending
15 rows affected.

[(1, datetime.date(1963, 7, 8), 'unemployed', 'USA'),
 (2, datetime.date(1957, 2, 7), 'unemployed', 'UK'),
 (3, datetime.date(1993, 2, 21), 'employed', 'CA'),
 (4, datetime.date(1978, 3, 19), 'employed', 'CA'),
 (5, datetime.date(2000, 10, 2), 'employed', 'USA'),
 (6, datetime.date(1974, 8, 5), 'unemployed', 'USA'),
 (7, datetime.date(1980, 7, 14), 'employed', 'UK'),
 (8, datetime.date(1995, 6, 24), 'unemployed', 'USA'),
 (9, datetime.date(1962, 2, 21), 'unemployed', 'USA'),
 (10, datetime.date(1992, 5, 28), 'employed', 'CA'),
 (11, datetime.date(2001, 11, 30), 'employed', 'CA'),
 (12, datetime.date(1981, 2, 5), 'unemployed', 'USA'),
 (13, datetime.date(1960, 7, 16), 'unemployed', 'UK'),
 (14, datetime.date(1962, 6, 15), 'employed', 'USA'),
 (15, datetime.date(1990, 6, 27), 'employed', 'UK')]

## Task 2
<p>You have been informed that there was a problem in the backend system as some of the <code>repayment_channel</code> values are missing. </p>
<p>The missing values are critical to the analysis so they need to be filled in before proceeding.</p>
<p>Luckily, they have discovered a pattern in the missing values:</p>
<ul>
<li>Repayment higher than 4000 dollars should be made via <code>bank account</code>.</li>
<li>Repayment lower than 1000 dollars should be made via <code>mail</code>.</li>
</ul>
<p>Return the corrected <code>repayment</code> table.</p>

In [3]:
%%sql 

-- Keep the two lines above
-- Start your answers here..
SELECT repayment_id, loan_id, repayment_date, repayment_amount, (CASE WHEN repayment_channel LIKE '-' AND repayment_amount < 1000 THEN 'mail'
                          WHEN repayment_channel LIKE '-' AND repayment_amount > 4000 THEN 'bank account'
                         ELSE repayment_channel
                         END) AS repayment_channel
FROM repayment
LIMIT 15;

 * postgresql://postgres:***@localhost:5432/lending
15 rows affected.

[(1, 357, datetime.date(2022, 10, 16), Decimal('1675.83'), 'bank account'),
 (2, 805, datetime.date(2023, 1, 12), Decimal('867.22'), 'debit card'),
 (3, 843, datetime.date(2022, 6, 2), Decimal('718.83'), 'phone'),
 (4, 243, datetime.date(2022, 12, 26), Decimal('1620.97'), 'credit card'),
 (5, 991, datetime.date(2023, 3, 18), Decimal('2182.17'), 'phone'),
 (6, 130, datetime.date(2023, 1, 31), Decimal('772.19'), 'mail'),
 (7, 903, datetime.date(2022, 5, 23), Decimal('1340.22'), 'bank account'),
 (8, 157, datetime.date(2022, 10, 11), Decimal('1381.22'), 'credit card'),
 (9, 121, datetime.date(2022, 6, 21), Decimal('1941.47'), 'credit card'),
 (10, 120, datetime.date(2023, 3, 31), Decimal('410.42'), 'mail'),
 (11, 408, datetime.date(2023, 2, 28), Decimal('1614.64'), 'bank account'),
 (12, 483, datetime.date(2022, 11, 28), Decimal('1507.0'), 'bank account'),
 (13, 584, datetime.date(2022, 5, 16), Decimal('4453.64'), 'mail'),
 (14, 675, datetime.date(2022, 11, 25), Decimal('2082.17'), 'mail'),
 (15, 845, datetime.date(2022, 12, 28), Decimal('2406.58'), 'credit card')]

## Task 3
<p>Starting on January 1st, 2022, all US clients started to use an online signing system.</p>
<p>The analytics team wants to analyze the loan portfolio for the US clients via the new online signing system.</p>
<p><img src="datasets/lending_schema.png"></p>
<p>Write a query that returns the data for the analytics team. Your output should include <code>client_id</code>,<code>contract_date</code>, <code>principal_amount</code> and <code>loan_type</code> columns.</p>

In [4]:
%%sql 

-- Keep the two lines above
-- Start your answers here..
SELECT client_id, contract_date, principal_amount, loan_type
FROM loan
INNER JOIN contract
USING(contract_id)
INNER JOIN client
USING(client_id)
WHERE country = 'USA' AND contract_date >= '2022-01-01'
LIMIT 15;

 * postgresql://postgres:***@localhost:5432/lending
15 rows affected.

[(267, datetime.date(2022, 3, 8), Decimal('179230'), 'personal'),
 (50, datetime.date(2022, 1, 13), Decimal('143729'), 'mortgage'),
 (280, datetime.date(2022, 1, 2), Decimal('171122'), 'car'),
 (79, datetime.date(2022, 1, 24), Decimal('43784'), 'mortgage'),
 (245, datetime.date(2022, 1, 3), Decimal('95003'), 'mortgage'),
 (181, datetime.date(2022, 2, 16), Decimal('45866'), 'mortgage'),
 (194, datetime.date(2022, 1, 3), Decimal('174800'), 'car'),
 (251, datetime.date(2022, 4, 14), Decimal('93214'), 'personal'),
 (128, datetime.date(2022, 3, 27), Decimal('44186'), 'personal'),
 (211, datetime.date(2022, 3, 18), Decimal('107766'), 'car'),
 (86, datetime.date(2022, 3, 14), Decimal('189723'), 'car'),
 (267, datetime.date(2022, 3, 7), Decimal('89311'), 'personal'),
 (50, datetime.date(2022, 3, 24), Decimal('150547'), 'personal'),
 (42, datetime.date(2022, 1, 10), Decimal('44279'), 'mortgage'),
 (252, datetime.date(2022, 3, 24), Decimal('161071'), 'car')]

## Task 4
<p>The business strategy team is considering offering a more competitive rate to the US market. </p>
<p>The analytic team want to compare the average interest rates offered by the company for the same loan type in different countries to determine if there are significant differences.</p>
<p><img src="datasets/lending_schema.png"></p>
<p>Write a query that returns the data for the analytics team. Your output should include <code>loan_type</code>, <code>country</code> and <code>avg_rate</code> columns.</p>

In [5]:
%%sql 
    
-- Keep the two lines above
-- Start your answers here..
SELECT loan_type, country, AVG(interest_rate) AS avg_rate
FROM loan
INNER JOIN client
USING(client_id)
GROUP BY loan_type, country

 * postgresql://postgres:***@localhost:5432/lending
9 rows affected.

[('car', 'USA', Decimal('0.10363636363636363636')),
 ('personal', 'CA', Decimal('0.21725274725274725275')),
 ('personal', 'USA', Decimal('0.20272058823529411765')),
 ('mortgage', 'CA', Decimal('0.04406779661016949153')),
 ('mortgage', 'UK', Decimal('0.04228070175438596491')),
 ('car', 'UK', Decimal('0.12261261261261261261')),
 ('personal', 'UK', Decimal('0.19873786407766990291')),
 ('mortgage', 'USA', Decimal('0.04385964912280701754')),
 ('car', 'CA', Decimal('0.11203883495145631068'))]